{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "inputs", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 105, 128], "dtype": "float32", "sparse": false, "name": "inputs"}, "inbound_nodes": []}, {"name": "epsilon", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "epsilon"}, "inbound_nodes": []}, {"name": "encoder", "class_name": "Model", "config": {"name": "encoder", "layers": [{"name": "inputs", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 105, 128], "dtype": "float32", "sparse": false, "name": "inputs"}, "inbound_nodes": []}, {"name": "lstm_1", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "latent_mean", "class_name": "Dense", "config": {"name": "latent_mean", "trainable": true, "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "latent_log_var", "class_name": "Dense", "config": {"name": "latent_log_var", "trainable": true, "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "kl_divergence_layer_1", "class_name": "KLDivergenceLayer", "config": {"name": "kl_divergence_layer_1", "trainable": true}, "inbound_nodes": [[["latent_mean", 0, 0, {}], ["latent_log_var", 0, 0, {}]]]}, {"name": "latent_std", "class_name": "Lambda", "config": {"name": "latent_std", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcw4AAAB0AGoBZAF8ABQAgwFTACkCTucAAAAAAADgPykC2gFL\n2gNleHApAdoBdKkAcgUAAAD6EHRyYWluX3Jubl9nZW4ucHnaCDxsYW1iZGE+OQAAAHMAAAAA\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["kl_divergence_layer_1", 0, 1, {}]]]}, {"name": "epsilon", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "epsilon"}, "inbound_nodes": []}, {"name": "multiply_1", "class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true}, "inbound_nodes": [[["latent_std", 0, 0, {}], ["epsilon", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["kl_divergence_layer_1", 0, 0, {}], ["multiply_1", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0], ["epsilon", 0, 0]], "output_layers": [["add_1", 0, 0]]}, "inbound_nodes": [[["inputs", 0, 0, {}], ["epsilon", 0, 0, {}]]]}, {"name": "regressor", "class_name": "Model", "config": {"name": "regressor", "layers": [{"name": "latent_inputs", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "latent_inputs"}, "inbound_nodes": []}, {"name": "outputs", "class_name": "Dense", "config": {"name": "outputs", "trainable": true, "units": 4, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["latent_inputs", 0, 0, {}]]]}, {"name": "output_scaling", "class_name": "Lambda", "config": {"name": "output_scaling", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwgAAAB8AGQBFABTACkCTmcAAAAAAMBfQKkAKQHaAXhyAQAA\nAHIBAAAA+jUvVXNlcnMvSmVmZi9Ecm9wYm94L1Jlc2VhcmNoL1RpbWJyZU1hcC91dGlsL21vZGVs\ncy5wedoIPGxhbWJkYT4bAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["outputs", 0, 0, {}]]]}], "input_layers": [["latent_inputs", 0, 0]], "output_layers": [["output_scaling", 0, 0]]}, "inbound_nodes": [[["encoder", 1, 0, {}]]]}], "input_layers": [["inputs", 0, 0], ["epsilon", 0, 0]], "output_layers": [["regressor", 1, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}