{"class_name": "Model", "config": {"name": "regressor", "layers": [{"name": "latent_inputs", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "latent_inputs"}, "inbound_nodes": []}, {"name": "outputs", "class_name": "Dense", "config": {"name": "outputs", "trainable": true, "units": 9, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["latent_inputs", 0, 0, {}]]]}, {"name": "output_scaling", "class_name": "Lambda", "config": {"name": "output_scaling", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwgAAAB8AGQBFABTACkCTmcAAAAAAMBfQKkAKQHaAXhyAQAA\nAHIBAAAA+jUvVXNlcnMvSmVmZi9Ecm9wYm94L1Jlc2VhcmNoL1RpbWJyZU1hcC91dGlsL21vZGVs\ncy5wedoIPGxhbWJkYT4bAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["outputs", 0, 0, {}]]]}], "input_layers": [["latent_inputs", 0, 0]], "output_layers": [["output_scaling", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}